In [2]:
from pandas import Series, DataFrame
import pandas as pd
import os
import numpy as np
import datetime as dt

In [3]:
print(os.getcwd())

/Users/zifuche/Desktop/Python Assignment3

In [4]:
df = pd.read_csv(os.getcwd()+'/vehicle_collisions.csv')
df1=df[df["DATE"].str.endswith("16")]

In [5]:
df1.head()

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR
217539,3374565,1/1/16,0:01,MANHATTAN,10022.0,40.760223,-73.967462,"(40.7602226, -73.967462)",EAST 57 STREET,3 AVENUE,...,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN,NaN,OTHER VEHICULAR,OTHER VEHICULAR,NaN,NaN,NaN
217540,3511927,1/1/16,0:01,BROOKLYN,11235.0,NaN,NaN,NaN,EMMONS AVENUE,OCEAN AVENUE,...,PASSENGER VEHICLE,BICYCLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN
217541,3363408,1/1/16,0:01,MANHATTAN,10035.0,40.805057,-73.939034,"(40.8050573, -73.9390342)",EAST 125 STREET,PARK AVENUE,...,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,UNSPECIFIED,NaN,NaN,NaN,NaN
217542,3364610,1/1/16,0:05,MANHATTAN,10035.0,40.799258,-73.939050,"(40.7992577, -73.9390504)",3 AVENUE,EAST 118 STREET,...,PASSENGER VEHICLE,PASSENGER VEHICLE,NaN,NaN,NaN,UNSPECIFIED,UNSPECIFIED,NaN,NaN,NaN
217543,3363371,1/1/16,0:15,MANHATTAN,10011.0,40.738552,-73.999682,"(40.738552, -73.9996824)",7 AVENUE,WEST 14 STREET,...,SPORT UTILITY/STATION WAGON,OTHER,NaN,NaN,NaN,LOST CONSCIOUSNESS,UNSPECIFIED,NaN,NaN,NaN

In [6]:
df2=df1[["DATE","BOROUGH"]]

# data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
# 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# frame = DataFrame(data)
# frame


# data={"MONTH":["JAN","FEB","MAR","APR","MAY","JUN","JUL","AUG","SEP","OCT","NOV","DEC"],"MANHATTAN"}
def getMonth(s):
    return s.split("/")[0]
def getDay(s):
    return s.split("/")[1]

In [7]:
df2.head()

          DATE    BOROUGH
217539  1/1/16  MANHATTAN
217540  1/1/16   BROOKLYN
217541  1/1/16  MANHATTAN
217542  1/1/16  MANHATTAN
217543  1/1/16  MANHATTAN

In [8]:
df3=df2[df2["DATE"].str.startswith("1/")]
df3.head()

          DATE    BOROUGH
217539  1/1/16  MANHATTAN
217540  1/1/16   BROOKLYN
217541  1/1/16  MANHATTAN
217542  1/1/16  MANHATTAN
217543  1/1/16  MANHATTAN

In [12]:
df3[df3["BOROUGH"]=="MANHATTAN"].head()

          DATE    BOROUGH
217539  1/1/16  MANHATTAN
217541  1/1/16  MANHATTAN
217542  1/1/16  MANHATTAN
217543  1/1/16  MANHATTAN
217549  1/1/16  MANHATTAN

In [10]:
len(df3.index)

18101

In [ ]:
# data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
# 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
# frame = DataFrame(data)
# frame
# DataFrame(data, columns=['year', 'state', 'pop'])

In [24]:
def caculater(month):
    df3=df2[df2["DATE"].str.startswith(month+"/")]
    df4=df3[df3["BOROUGH"]=="MANHATTAN"]
    data={"MONTH":[month],"MANHATTAN":[len(df4.index)],"NYC":[len(df3.index)],"PERCENTAGE":[len(df4.index)/len(df3.index)]}
    frame=DataFrame(data,columns=["MONTH","MANHATTAN","NYC","PERCENTAGE"])
    return frame

In [25]:
caculater("1")

  MONTH  MANHATTAN    NYC  PERCENTAGE
0     1       3178  18101     0.17557

In [69]:
monthlist=["2","3","4","5","6","7","8","9","10","11","12"]

# frame1=[caculater("1"),caculater("2")]
# result=pd.concat(frame1)

In [70]:
def getre(monthlist):
    result=caculater("1")
    for month in monthlist:       
        frame=[result,caculater(month)]
        result=pd.concat(frame)
    return result

In [63]:
df5=getre(monthlist)

In [72]:
df5["MONTH"].replace(["1","2","3","4","5","6","7","8","9","10","11","12"],["JAN","FEB","MAR","APR","MAY","JUN","JUL","AUG","SEP","OCT","NOV","DEC"],inplace=True)

In [68]:
df5

  MONTH  MANHATTAN    NYC  PERCENTAGE
0   JAN       3178  18101    0.175570
0   FEB       3195  15985    0.199875
0   MAR       3479  18471    0.188349
0   APR       3540  18331    0.193115
0   MAY       3432  20052    0.171155
0   JUN       2956  19433    0.152112
0   JUL       3055  19867    0.153773
0   AUG       2844  19678    0.144527
0   SEP       2744  19492    0.140776
0   OCT       2831  19666    0.143954
0   NOV       2838  19315    0.146932
0   DEC       2634  19214    0.137088

In [73]:
df5.to_csv('Q1.csv',index= False)